import MariaVladimirovna as Mv
import Darya as Da


MorseCode = {'Q': '--.-', 'W': '.--', 'E': '.', 'R': '.-.', 'T': '-',
             'Y': '-.--', 'U': '..-', 'I': '..', 'O': '---', 'P': '.--.',
             'A': '.-', 'S': '...', 'D': '-..', 'F': '..-.', 'G': '--.',
             'H': '....', 'J': '.---', 'K': '-.-', 'L': '.-..', 'Z': '--..',
             'X': '-..-', 'C': '-.-.', 'V': '...-', 'B': '-...', 'N': '-.',
             'M': '--', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....', '6': '-....', '7': '--...', '8': '---..',
             '9': '----.', '0': '-----'}


def main():
    print("Введите, пожалуйста, функцию, которую необходимо выполнить (кодирование или декодирование:")
    func = input().lower()
    # Пользователь вводит название функции, которая сразу переводится в нижний регистр для дальшейшего более
    # удобного использования.
    while (func not in ['кодирование', "в код", "в морзе", "закодировать", "кодировать"] or
           func not in ['декодирование', "раскодирование", "декодировка", "декодировать", ]):
        print('Неверный ввод. Необходимо вводить только название на русском языке, без цифр и знаков.')
        print("Попробуйте ещё раз:")
        func = input()
    print("Введите текст")
    if func in ['кодирование', "в код", "в морзе", "закодировать", "кодировать"]