import Darya as Da


MorseCode = {'Q': '--.-', 'W': '.--', 'E': '.', 'R': '.-.', 'T': '-',
             'Y': '-.--', 'U': '..-', 'I': '..', 'O': '---', 'P': '.--.',
             'A': '.-', 'S': '...', 'D': '-..', 'F': '..-.', 'G': '--.',
             'H': '....', 'J': '.---', 'K': '-.-', 'L': '.-..', 'Z': '--..',
             'X': '-..-', 'C': '-.-.', 'V': '...-', 'B': '-...', 'N': '-.',
             'M': '--', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....', '6': '-....', '7': '--...', '8': '---..',
             '9': '----.', '0': '-----'}


def encode_to_morse(text):
    # переводим в верхний регистр и разбиваем текст по символам пустого пространства
    text = text.upper().split()
    code_morse = []  # пустой список закодированных слов
    for word in text:  # перебираем слова исходноо текста
        string = ''  # каждое слово кодируем отдельно
        for char in word:  # перебираем символы слова
            if char in MorseCode:
                code_morse.append(MorseCode[char])  # кодируем
    return code_morse  # или ' '.join(code_morse)


def main():
    print("Введите, пожалуйста, функцию, которую необходимо выполнить (кодирование или декодирование):")
    func = input().lower()
    # Пользователь вводит название функции, которая сразу переводится в нижний регистр для дальшейшего более
    # удобного использования.
    while (func.lower() not in ['кодирование', "в код", "в морзе", "закодировать", "кодировать",
                                'декодирование', "раскодирование", "декодировка", "декодировать", ]):  # Проверка кода
        print('Неверный ввод. Необходимо вводить только название на русском языке, без цифр и знаков.')
        print("Попробуйте ещё раз:")
        func = input()
    if func in ['кодирование', "в код", "в морзе", "закодировать", "кодировать"]:
        print('Введите текст для кодирования:')
        text = input()
        print(' '.join(encode_to_morse(text)))


main()
