MorseCode = {'Q': '--.-', 'W': '.--', 'E': '.', 'R': '.-.', 'T': '-',
             'Y': '-.--', 'U': '..-', 'I': '..', 'O': '---', 'P': '.--.',
             'A': '.-', 'S': '...', 'D': '-..', 'F': '..-.', 'G': '--.',
             'H': '....', 'J': '.---', 'K': '-.-', 'L': '.-..', 'Z': '--..',
             'X': '-..-', 'C': '-.-.', 'V': '...-', 'B': '-...', 'N': '-.',
             'M': '--', '1': '.----', '2': '..---', '3': '...--', '4': '....-',
             '5': '.....', '6': '-....', '7': '--...', '8': '---..',
             '9': '----.', '0': '-----'}
MorseCode_rus = {'1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....',
                 '7': '--...', '8': '---..', '9': '----.', '0': '-----', "Й": '.---', "Ц": '-.-.',
                 "У": '..-', "К": '-.-', "Н": '-.', "Г": '--.', "Ш": '----', "Щ": '--.-',
                 'З': '--..', 'Х': '....', 'Ъ': '-..-', 'Ф': '..-.', 'Ы': '-.--', 'В': '.--',
                 'А': '.-', 'П': '.--.', 'Р': '.-.', 'О': '---', 'Л': '.-..', 'Д': '-..',
                 'Ж': '...-', 'Э': '..-..', 'Я': '.-.-', 'Ч': '---.', 'С': '...', 'М': '--',
                 'И': '..', 'Т': '-', 'Ь': '-..-', 'Б': '-...', 'Ю': '..--'}


def encode_to_morse(text):
    # переводим в верхний регистр и разбиваем текст по символам пустого пространства
    text = text.upper().split()
    code_morse = []  # пустой список закодированных слов
    for word in text:  # перебираем слова исходноо текста
        string = ''  # каждое слово кодируем отдельно
        for char in word:  # перебираем символы слова
            if char in MorseCode:
                code_morse.append(MorseCode[char])  # кодируем
    return code_morse  # или ' '.join(code_morse)


def decode_from_morse(code):
    new_MorseCode, new_MorseCode_rus = {}, {}
    for codes, letters in MorseCode.items():
        new_MorseCode[letters] = codes
    for codes, letters in MorseCode_rus.items():
        new_MorseCode_rus[letters] = codes
    # меняем местами ключи и значения(разворачиваем словарь)
    code = code.split()  # создаем список закодированных символов
    spisok = []  # пустой список для расшифрованных символов
    print('Декодировать в кириллицу или латиницу?')
    lang = input().lower()
    while len(spisok) != len(code):
        if 'лат' in lang:
            for symb in code:  # перебираем зашифрованные символы
                if symb in new_MorseCode:
                    spisok.append(new_MorseCode[symb])  # декодируем
        elif 'кир' in lang:
            for symb in code:  # перебираем зашифрованные символы
                if symb in new_MorseCode_rus:
                    spisok.append(new_MorseCode_rus[symb])  # декодируем
        else:
            print('Неверно введён вид письменности.')
            print('Попробуйте ещё раз (латиница или кириллица):')
            lang = input().lower()
    return spisok


def main():
    print("Введите, функцию, которую необходимо выполнить (кодирование или декодирование):")
    func = input().lower()
    # Пользователь вводит название функции, которая сразу переводится в нижний регистр для
    # дальнейщего более удобного использования.
    while (func.lower() not in ['кодирование', "в код", "в морзе", "закодировать", "кодировать",
                                'декодирование', "раскодирование", "декодировка", "декодировать", ]):
        # Проверка кода
        print('Неверный ввод. Необходимо вводить только название на русском языке, без цифр', end='')
        print(' и знаков.')
        print("Попробуйте ещё раз:")
        func = ''
        func = input().lower()
    if func in ['кодирование', "в код", "в морзе", "закодировать", "кодировать"]:
        # Если выбрано кодирование.
        print('Введите текст для кодирования:')
        text = input()
        print(' '.join(encode_to_morse(text)))
    if func in ['декодирование', "раскодирование", "декодировка", "декодировать", ]:
        # Если выбрано декодирование.
        print('Введите код:')
        code = input()
        print(''.join(decode_from_morse(code)))
    input('Нажмите Enter, чтобы выйти')  # Выход
